package main

import (
	"fmt"
	"pushbot/bot"
	"pushbot/config"
	"time"
)

func main() {
	message := `
	$$$$$$$\  $$\                     $$\        $$$$$$\  $$\                 $$\                 $$$$$$$\   $$$$$$\ $$$$$$$$\ 
	$$  __$$\ $$ |                    $$ |      $$  __$$\ $$ |                \__|                $$  __$$\ $$  __$$\\__$$  __|
	$$ |  $$ |$$ | $$$$$$\   $$$$$$$\ $$ |  $$\ $$ /  \__|$$$$$$$\   $$$$$$\  $$\ $$$$$$$\        $$ |  $$ |$$ /  $$ |  $$ |   
	$$$$$$$\ |$$ |$$  __$$\ $$  _____|$$ | $$  |$$ |      $$  __$$\  \____$$\ $$ |$$  __$$\       $$$$$$$\ |$$ |  $$ |  $$ |   
	$$  __$$\ $$ |$$ /  $$ |$$ /      $$$$$$  / $$ |      $$ |  $$ | $$$$$$$ |$$ |$$ |  $$ |      $$  __$$\ $$ |  $$ |  $$ |   
	$$ |  $$ |$$ |$$ |  $$ |$$ |      $$  _$$<  $$ |  $$\ $$ |  $$ |$$  __$$ |$$ |$$ |  $$ |      $$ |  $$ |$$ |  $$ |  $$ |   
	$$$$$$$  |$$ |\$$$$$$  |\$$$$$$$\ $$ | \$$\ \$$$$$$  |$$ |  $$ |\$$$$$$$ |$$ |$$ |  $$ |      $$$$$$$  | $$$$$$  |  $$ |   
	\_______/ \__| \______/  \_______|\__|  \__| \______/ \__|  \__| \_______|\__|\__|  \__|      \_______/  \______/   \__|   power by wh1t3zer
	`
	fmt.Println(message)
	fmt.Println("BlockChainBot 正在启用链上监听")
	for {
		bot.MonitorSmartWalletBsc()
		//bot.MonitorSmartWalletEth()
		//bot.MonitorSmartWalletSol()
		t := config.HandleYaml().Common.Duration
		time.Sleep(time.Duration(t) * time.Second)
	}
	//binance.Monitor_delist()
}
